Revit 2024 API
TransmissionData.ReadTransmissionData Method
 Reads the TransmissionData associated with the file at the given location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static TransmissionData ReadTransmissionData(
	ModelPath path
)
Visual Basic
Public Shared Function ReadTransmissionData ( _
	path As ModelPath _
) As TransmissionData
Visual C++
public:
static TransmissionData^ ReadTransmissionData(
	ModelPath^ path
)
Parameters
path
Type: Autodesk.Revit.DB.ModelPath
 A ModelPath indicating the file Revit should read the TransmissionData of. If this ModelPath is a file path, it must be an absolute path.
Return Value
 The TransmissionData containing external file information for the file at the given location.
Remarks
 The TransmissionData returned by this function contains data about all ExternalFileReferences in the document. ExternalResourceReferences to extenal servers will not be returned by this function. TransmissionData contains information about local or Revit Server references only.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.CentralModelAccessDeniedException |  Access to the central model was denied. A possible reason is because the model was under maintenance.
Autodesk.Revit.Exceptions.CentralModelContentionException |  The central model are locked by another client.
Autodesk.Revit.Exceptions.CentralModelException |  The central model is missing. -or- An internal error happened on the central model, please contact the server administrator.
Autodesk.Revit.Exceptions.FileArgumentNotFoundException |  There is not a valid Revit file at path's location
Autodesk.Revit.Exceptions.RevitServerCommunicationException |  The server-based central model could not be accessed because of a network communication error.
See Also
TransmissionData Class
Autodesk.Revit.DB Namespace